Revit 2026 API

# ComponentRepeaterGetEnumerator Method

---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<ComponentRepeaterSlot> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of ComponentRepeaterSlot)
```
```cpp
public:
virtual IEnumerator<ComponentRepeaterSlot^>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<ComponentRepeaterSlot>
override GetEnumerator : unit -> IEnumerator<ComponentRepeaterSlot>
```

#### Return Value

IEnumeratorComponentRepeaterSlotAn IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

ComponentRepeater Class

Autodesk.Revit.DB Namespace